const sheetJSON =[
    {
        "__EMPTY": "资产:",
        "2002年年报": "",
        "2003年年报": "",
        "2004年年报": "",
        "2005年年报": "",
        "2006年年报": "",
        "2007年年报": "",
        "2008年年报": "",
        "2009年年报": "",
        "2010年年报": "",
        "2011年年报": "",
        "2012年年报": "",
        "2013年年报": "",
        "2014年年报": "",
        "2015年年报": "",
        "2016年年报": "",
        "2017年年报": "",
        "2018年年报": "",
        "2019年年报": "",
        "2020年年报": "",
        "2021年年报": ""
    },
]

export default sheetJSON;